app/controllers/examples_controller.rb

SELECT "examples".* FROM "examples"
---
  def index
    @examples = Example.all

SELECT "examples".* FROM "examples" WHERE "examples"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @example = Example.find(params[:id])

SELECT "examples".* FROM "examples" WHERE "examples"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @example = Example.find(params[:id])

SELECT "examples".* FROM "examples" WHERE "examples"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "examples" SET "available_functions" = 'var helper = function () {
---
  def update
    @example = Example.find(params[:id])

    respond_to do |format|
      if @example.update_attributes(params[:example])